app/views/events/_form.html.erb

            <br>
            <%= form.collection_select(:event_place_id, EventPlace.all, :id, :name) %>
---
SELECT "event_places".* FROM "event_places"