app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("name", "description", "place_name", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]